## Plan Result (ithc-backendappgateway)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]
* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw"
        name                = "cft-aks00-ithc-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/draft-store-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "draft-store-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/cmc-pdf-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "cmc-pdf-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rpe-pdf-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rpe-pdf-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rpe-service-auth-provider"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rpe-service-auth-provider"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/camunda-bpm"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "camunda-bpm"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/camunda-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "camunda-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/camunda-optimize"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "camunda-optimize"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/probate-business-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "probate-business-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/probate-orchestrator-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "probate-orchestrator-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/probate-submit-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "probate-submit-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/probate-back-office"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "probate-back-office"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/pcq-backend"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "pcq-backend"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/lau-case-backend"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "lau-case-backend"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/lau-idam-backend"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "lau-idam-backend"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-case-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-case-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-case-notifications-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-case-notifications-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-case-documents-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-case-documents-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-home-office-integration-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-home-office-integration-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-home-office-mock-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-home-office-mock-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-timed-event-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-timed-event-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-case-access-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-case-access-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-case-payments-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-case-payments-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ia-bail-case-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "ia-bail-case-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/am-role-assignment-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "am-role-assignment-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/am-org-role-mapping-service"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "am-org-role-mapping-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-professional-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-professional-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-user-profile-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-user-profile-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-profile-sync"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-profile-sync"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-judicial-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-judicial-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-judicial-data-load"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-judicial-data-load"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-caseworker-ref-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-caseworker-ref-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-location-ref-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-location-ref-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-location-ref-data-load"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-location-ref-data-load"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/rd-commondata-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "rd-commondata-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-emca"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "div-emca"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-fps"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "div-fps"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-dgs"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "div-dgs"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-cms"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "div-cms"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-cos"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "div-cos"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-cfs"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "div-cfs"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ith

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

pi"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/adoption-cos-api"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "adoption-cos-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/prl-cos"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "prl-cos"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/prl-dgs"
          ~ ip_addresses = [
                "10.11.207.250",
              - "10.11.223.250",
            ]
            name         = "prl-dgs"
            # (1 unchanged attribute hidden)
        }












        # (413 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_application_gateway.ag[1] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-aks01-ithc-agw"
      + resource_group_name = "cft-ithc-network-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.207.250",
            ]
          + name         = "sscs-hearings-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.207.250",
            ]
          + name         = "hmc-cft-hearing-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.207.250",
            ]
          + name         = "hmc-hmi-inbound-adapter"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.207.250",
            ]
          + name         = "hmc-hmi-outbound-adapter"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "sscs-hearings-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "sscs-hearings-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "hmc-cft-hearing-service"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "hmc-cft-hearing-service"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "hmc-hmi-inbound-adapter"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "hmc-hmi-inbound-adapter"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "hmc-hmi-outbound-adapter"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "hmc-hmi-outbound-adapter"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + public_ip_address_id          = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-ithc-pip"
          + subnet_id                     = (known after apply)
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPrivateFrontendIp"
          + private_ip_address            = "10.11.225.111"
          + private_ip_address_allocation = "Static"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ithc-vnet/subnets/aks-appgw"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ithc-vnet/subnets/aks-appgw"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "sscs-hearings-api-ithc.service.core-compute-ithc.internal"
          + id                             = (known after apply)
          + name                           = "sscs-hearings-api"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "hmc-cft-hearing-service-ithc.service.core-compute-ithc.internal"
          + id                             = (known after apply)
          + name                           = "hmc-cft-hearing-service"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "hmc-hmi-inbound-adapter-ithc.service.core-compute-ithc.internal"
          + id                             = (known after apply)
          + name                           = "hmc-hmi-inbound-adapter"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "hmc-hmi-outbound-adapter-ithc.service.core-compute-ithc.internal"
          + id                             = (known after apply)
          + name                           = "hmc-hmi-outbound-adapter"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-aks-ithc-agw",
            ]
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "sscs-hearings-api-ithc.service.core-compute-ithc.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "sscs-hearings-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "hmc-cft-hearing-service-ithc.service.core-compute-ithc.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "hmc-cft-hearing-service"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "hmc-hmi-inbound-adapter-ithc.service.core-compute-ithc.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "hmc-hmi-inbound-adapter"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "hmc-hmi-outbound-adapter-ithc.service.core-compute-ithc.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "hmc-hmi-outbound-adapter"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-cft-hearing-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-cft-hearing-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-cft-hearing-service"
          + id                         = (known after apply)
          + name                       = "hmc-cft-hearing-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-hmi-inbound-adapter"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-hmi-inbound-adapter"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-hmi-inbound-adapter"
          + id                         = (known after apply)
          + name                       = "hmc-hmi-inbound-adapter"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-hmi-outbound-adapter"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-hmi-outbound-adapter"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-hmi-outbound-adapter"
          + id                         = (known after apply)
          + name                       = "hmc-hmi-outbound-adapter"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-hearings-api"
          + id                         = (known after apply)
          + name                       = "sscs-hearings-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_certificate {
          + id                  = (known after apply)
          + key_vault_secret_id = "https://acmedcdcftappsithc.vault.azure.net/secrets/wildcard-ithc-platform-hmcts-net"
          + name                = "wildcard-ithc-platform-hmcts-net"
          + public_cert_data    = (known after apply)
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1212,"Program":"tfcmt","SHA1":"","Target":"ithc-backendappgateway","Vars":{}} -->